package random

import (
	"fmt"
	"reflect"
	"strconv"
	"strings"
	"time"
)

var Xing = [453]string{"赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许", "何吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢", "邹喻", "柏", "水", "窦", "章", "云", "苏", "潘葛", "奚范彭", "郎", "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞任袁", "柳", "酆", "鲍", "史", "唐", "费廉岑", "薛", "雷贺倪", "汤", "滕殷罗", "毕", "郝", "邬安常", "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", "元", "卜", "顾", "孟", "平", "黄", "和", "穆萧尹", "姚", "邵", "堪", "汪", "祁毛禹", "狄", "米", "贝", "明", "臧", "计", "伏", "成", "戴", "谈宋茅", "庞", "熊", "纪", "舒", "屈", "项", "祝", "董", "粱", "杜", "阮蓝", "闵", "席", "季", "麻", "强", "贾", "路", "娄", "危", "江", "童颜", "郭", "梅", "盛", "林", "刁", "钟", "徐", "丘", "骆", "高夏蔡", "田", "樊胡凌", "霍", "虞", "万支柯", "昝", "管卢莫", "经", "房", "裘", "缪干", "解应", "宗", "丁宣贲", "邓", "郁", "单杭", "洪", "包", "诸", "左", "石", "崔吉", "钮龚", "程", "嵇", "邢", "滑", "裴陆荣", "翁", "荀羊", "於", "惠", "甄魏家", "封", "芮羿", "储靳", "汲", "邴", "糜", "松", "井", "段", "富", "巫", "乌", "焦", "巴", "弓", "牧", "隗", "山谷", "车", "侯", "宓蓬", "全", "郗班仰", "秋", "仲", "伊", "宫", "宁", "仇栾", "暴", "甘", "钭", "厉戎", "祖", "武", "符", "刘", "景", "詹束龙", "叶", "幸", "司韶", "郜黎", "蓟", "薄印", "宿", "白", "怀", "蒲", "台", "从", "鄂", "索", "咸", "籍", "赖", "卓", "蔺", "屠蒙", "池", "乔", "阴郁", "胥", "能", "苍", "双", "闻莘", "党", "翟谭贡", "劳", "逄", "姬", "申", "扶", "堵", "冉", "宰", "郦", "雍", "却", "璩", "桑", "桂", "濮", "牛", "寿", "通", "边", "扈燕冀", "郏", "浦", "尚", "农", "温", "别", "庄晏", "柴", "瞿", "阎", "充", "慕", "连茹习", "宦艾鱼容向", "古", "易", "慎", "戈", "廖", "庾", "终", "暨", "居", "衡", "步", "都", "耿", "满", "弘", "匡国文", "寇", "广", "禄", "阙", "东", "殴", "殳", "沃", "利", "蔚", "越", "夔", "隆", "师巩", "厍", "聂", "晁", "勾敖融", "冷", "訾", "辛", "阚", "那", "简", "饶", "空", "曾", "毋", "沙", "乜", "养", "鞠须丰", "巢", "关", "蒯相", "查后荆", "红", "游", "竺", "权", "逯", "盖", "后", "桓", "公", "万俟司", "马", "上官", "欧阳", "夏侯", "诸葛", "闻人", "东方", "赫", "连", "皇甫", "尉迟", "公羊", "澹", "台", "公", "冶", "宗", "政", "濮", "阳", "淳于", "单于", "太", "叔", "申屠", "公孙", "仲", "孙", "轩辕", "令", "狐", "钟", "离", "宇文", "长孙", "慕容", "鲜于", "闾", "丘", "司徒", "司空", "亓", "官", "司寇", "仉", "督", "子车", "颛", "孙", "端木", "巫马公", "西", "漆雕", "乐", "正", "壤", "驷", "公", "良", "拓", "拔", "夹", "谷", "宰", "父", "谷", "粱", "晋楚闫", "法", "汝", "鄢", "涂", "钦", "段", "干", "百里", "东郭", "南", "门", "呼延", "归", "海", "羊", "舌", "微", "生", "岳", "帅", "缑", "亢", "况", "后", "有", "琴", "梁", "丘", "左", "丘", "东门", "西门", "商", "牟", "佘", "佴", "伯", "赏", "南", "宫", "墨", "哈", "谯", "笪", "年", "爱", "阳", "佟", "第", "五", "言", "福", "百", "家", "姓", "终"}
var Ming = [350]string{"伟", "刚", "勇", "毅", "俊", "峰", "强", "军", "平", "保", "东", "文", "辉", "力", "明", "永", "健", "世", "广", "志", "义", "兴", "良", "海", "山", "仁", "波", "宁", "贵", "福", "生", "龙", "元", "全", "国", "胜", "学", "祥", "才", "发", "武", "新", "利", "清", "飞", "彬", "富", "顺", "信", "子", "杰", "涛", "昌", "成", "康", "星", "光", "天", "达", "安", "岩", "中", "茂", "进", "林", "有", "坚", "和", "彪", "博", "诚", "先", "敬", "震", "振", "壮", "会", "思", "群", "豪", "心", "邦", "承", "乐", "绍", "功", "松", "善", "厚", "庆", "磊", "民", "友", "裕", "河", "哲", "江", "超", "浩", "亮", "政", "谦", "亨", "奇", "固", "之", "轮", "翰", "朗", "伯", "宏", "言", "若", "鸣", "朋", "斌", "梁", "栋", "维", "启", "克", "伦", "翔", "旭", "鹏", "泽", "晨", "辰", "士", "以", "建", "家", "致", "树", "炎", "德", "行", "时", "泰", "盛", "雄", "琛", "钧", "冠", "策", "腾", "楠", "榕", "风", "航", "弘", "秀", "娟", "英", "华", "慧", "巧", "美", "娜", "静", "淑", "惠", "珠", "翠", "雅", "芝", "玉", "萍", "红", "娥", "玲", "芬", "芳", "燕", "彩", "春", "菊", "兰", "凤", "洁", "梅", "琳", "素", "云", "莲", "真", "环", "雪", "荣", "爱", "妹", "霞", "香", "月", "莺", "媛", "艳", "瑞", "凡", "佳", "嘉", "琼", "勤", "珍", "贞", "莉", "桂", "娣", "叶", "璧", "璐", "娅", "琦", "晶", "妍", "茜", "秋", "珊", "莎", "锦", "黛", "青", "倩", "婷", "姣", "婉", "娴", "瑾", "颖", "露", "瑶", "怡", "婵", "雁", "蓓", "纨", "仪", "荷", "丹", "蓉", "眉", "君", "琴", "蕊", "薇", "菁", "梦", "岚", "苑", "婕", "馨", "瑗", "琰", "韵", "融", "园", "艺", "咏", "卿", "聪", "澜", "纯", "毓", "悦", "昭", "冰", "爽", "琬", "茗", "羽", "希", "欣", "飘", "育", "滢", "馥", "筠", "柔", "竹", "霭", "凝", "晓", "欢", "霄", "枫", "芸", "菲", "寒", "伊", "亚", "宜", "可", "姬", "舒", "影", "荔", "枝", "丽", "阳", "妮", "宝", "贝", "初", "程", "梵", "罡", "恒", "鸿", "桦", "骅", "剑", "娇", "纪", "宽", "苛", "灵", "玛", "媚", "琪", "晴", "容", "睿", "烁", "堂", "唯", "威", "韦", "雯", "苇", "萱", "阅", "彦", "宇", "雨", "洋", "忠", "宗", "曼", "紫", "逸", "贤", "蝶", "菡", "绿", "蓝", "儿", "翠", "烟", "小", "轩"}

func RandName() string {
	var name strings.Builder
	name.WriteString(RandArray(Xing).(string))
	for i := RandInt(1, 2); i > 0; i-- {
		name.WriteString(RandArray(Ming).(string))
	}
	return name.String()
}

func RandArray(v any) any {
	data := reflect.ValueOf(v)
	if data.Kind() != reflect.Array && data.Kind() != reflect.Slice && data.Kind() != reflect.String {
		return nil
	}
	return data.Index(RandInt(0, data.Len()-1)).Interface()
}

var (
	// 身份证加权因子
	factor = [...]int{7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2}
	// 身份证校验码
	checkCode = [...]string{"1", "0", "X", "9", "8", "7", "6", "5", "4", "3", "2"}

	s = [...]string{"11", "12", "13", "14", "15", "21", "22", "23", "31", "32", "33", "34", "35", "36", "37", "41", "42", "43", "44", "45", "46", "50", "51", "52", "53", "54", "61", "62", "63", "64", "65", "71", "81", "82"}
)

// 随机身份证号
func RandIdNo(birthday time.Time) string {
	var id strings.Builder
	id.WriteString(RandArray(s).(string))
	id.WriteString(fmt.Sprintf("%02d", RandInt(1, 70)))
	id.WriteString(fmt.Sprintf("%02d", RandInt(1, 99)))

	id.WriteString(birthday.Format("20060102"))          // 生日码
	id.WriteString(fmt.Sprintf("%03d", RandInt(0, 999))) // 顺序码

	var weighted int
	for i, v := range id.String() {
		num, _ := strconv.Atoi(string(v))
		weighted += num * factor[i]
	}
	id.WriteString(checkCode[weighted%11])
	return id.String()
}

var phoneHead = [...]string{"139", "138", "137", "136", "135", "134", "159", "158", "157", "150", "151", "152", "188", "187", "182", "183", "184", "178", "130", "131", "132", "156", "155", "186", "185", "176", "133", "153", "189", "180", "181", "177"}

// 随机手机号
func RandPhone() string {
	var phone strings.Builder
	phone.WriteString(RandArray(phoneHead).(string))
	phone.WriteString(fmt.Sprintf("%08d", RandInt(0, 99999999)))
	return phone.String()
}
